somedata.xml

<?xml version=\"1.0\" encoding=\"UTF-8\"?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:sch=\"http://www.tibco.com/schemas/JioSales/RRIntegration/Shared Resources/Schemas/Schema.xsd\"><soapenv:Body><SalesRequest xmlns=\"http://www.tibco.com/schemas/JioSales/RRIntegration/Shared Resources/Schemas/Schema.xsd\" xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><Ticket><TICKET_ID>3TT5</TICKET_ID><POSDM><POSDMHEADER><RETAILSTOREID>I005</RETAILSTOREID><BUSINESSDAYDATE>20181022</BUSINESSDAYDATE><TRANSACTIONTYPECODE>1011</TRANSACTIONTYPECODE><WORKSTATIONID>18</WORKSTATIONID><TRANSACTIONSEQUENCENUMBER>3TT5</TRANSACTIONSEQUENCENUMBER></POSDMHEADER><TRANSACTION><BEGINDATETIMESTAMP>20181022134551</BEGINDATETIMESTAMP><ENDDATETIMESTAMP>20181022134551</ENDDATETIMESTAMP><DEPARTMENT>31323</DEPARTMENT><OPERATORQUALIFIER /><OPERATORID /><TRANSACTIONCURRENCY>INR</TRANSACTIONCURRENCY><TRANSACTIONCURRENCY_ISO>INR</TRANSACTIONCURRENCY_ISO><PARTNERQUALIFIER /><PARTNERID /></TRANSACTION><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTNUMBER</DATAELEMENTID><DATAELEMENTVALUE>80</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTNAMES</DATAELEMENTID><DATAELEMENTVALUE>Ram Dave</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTZIP</DATAELEMENTID><DATAELEMENTVALUE>400093</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUST_ADD1</DATAELEMENTID><DATAELEMENTVALUE>14, Samartha CHS, S.M. Road, Andheri(E)</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTMOBILE</DATAELEMENTID><DATAELEMENTVALUE>9819000004</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUST_EMAIL</DATAELEMENTID><DATAELEMENTVALUE></DATAELEMENTVALUE></CUSTOMERDETAILS><RETAILLINEITEM><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><RETAILTYPECODE>2009</RETAILTYPECODE><RETAILREASONCODE>1010</RETAILREASONCODE><ITEMIDQUALIFIER>2</ITEMIDQUALIFIER><ITEMID>600518772</ITEMID><RETAILQUANTITY>1</RETAILQUANTITY><SALESUNITOFMEASURE /><SALESUNITOFMEASURE_ISO /><BAPISALESAMOUNT>0</BAPISALESAMOUNT><BAPINORMALSALESAMOUNT>0</BAPINORMALSALESAMOUNT><BAPICOST>0</BAPICOST><BATCHID /><SERIALNUMBER /><PROMOTIONID /><ITEMIDENTRYMETHODCODE /><BAPIACTUALUNITPRICE>0</BAPIACTUALUNITPRICE></RETAILLINEITEM><RETAILLINEITEM><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><RETAILTYPECODE>2009</RETAILTYPECODE><RETAILREASONCODE>1010</RETAILREASONCODE><ITEMIDQUALIFIER>2</ITEMIDQUALIFIER><ITEMID>000000000491192503</ITEMID><RETAILQUANTITY>1</RETAILQUANTITY><SALESUNITOFMEASURE /><SALESUNITOFMEASURE_ISO /><BAPISALESAMOUNT>0</BAPISALESAMOUNT><BAPINORMALSALESAMOUNT>0</BAPINORMALSALESAMOUNT><BAPICOST>0</BAPICOST><BATCHID /><SERIALNUMBER /><PROMOTIONID /><ITEMIDENTRYMETHODCODE /><BAPIACTUALUNITPRICE>0</BAPIACTUALUNITPRICE></RETAILLINEITEM><LINEITEMTAX><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER><TAXTYPECODE>4304</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><LINEITEMTAX><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>2</TAXSEQUENCENUMBER><TAXTYPECODE>4303</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><LINEITEMTAX><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER><TAXTYPECODE>4304</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><LINEITEMTAX><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>2</TAXSEQUENCENUMBER><TAXTYPECODE>4303</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><TENDER><TENDERSEQUENCENUMBER>2</TENDERSEQUENCENUMBER><TENDERTYPECODE>3101</TENDERTYPECODE><TENDERAMOUNT>0</TENDERAMOUNT><TENDERCURRENCY>INR</TENDERCURRENCY><TENDERCURRENCY_ISO>INR</TENDERCURRENCY_ISO><TENDERID /><ACCOUNTNUMBER /><REFERENCEID /></TENDER><RETAILADDITIONALS><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><SUPPLIERID>0010000007</SUPPLIERID><SPECIALSTOCKCODE /></RETAILADDITIONALS><RETAILADDITIONALS><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><SUPPLIERID>0010000007</SUPPLIERID><SPECIALSTOCKCODE /></RETAILADDITIONALS><ADDITIONALS><TRAININGFLAG /><KEYEDOFFLINEFLAG /></ADDITIONALS></POSDM></Ticket><MSG_ID>WAWBCWLF</MSG_ID></SalesRequest></soapenv:Body></soapenv:Envelope>'<?xml version=\"1.0\" encoding=\"UTF-8\"?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:sch=\"http://www.tibco.com/schemas/JioSales/RRIntegration/Shared Resources/Schemas/Schema.xsd\"><soapenv:Body><SalesRequest xmlns=\"http://www.tibco.com/schemas/JioSales/RRIntegration/Shared Resources/Schemas/Schema.xsd\" xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><Ticket><TICKET_ID>3TT5</TICKET_ID><POSDM><POSDMHEADER><RETAILSTOREID>I005</RETAILSTOREID><BUSINESSDAYDATE>20181022</BUSINESSDAYDATE><TRANSACTIONTYPECODE>1011</TRANSACTIONTYPECODE><WORKSTATIONID>18</WORKSTATIONID><TRANSACTIONSEQUENCENUMBER>3TT5</TRANSACTIONSEQUENCENUMBER></POSDMHEADER><TRANSACTION><BEGINDATETIMESTAMP>20181022134551</BEGINDATETIMESTAMP><ENDDATETIMESTAMP>20181022134551</ENDDATETIMESTAMP><DEPARTMENT>31323</DEPARTMENT><OPERATORQUALIFIER /><OPERATORID /><TRANSACTIONCURRENCY>INR</TRANSACTIONCURRENCY><TRANSACTIONCURRENCY_ISO>INR</TRANSACTIONCURRENCY_ISO><PARTNERQUALIFIER /><PARTNERID /></TRANSACTION><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTNUMBER</DATAELEMENTID><DATAELEMENTVALUE>80</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTNAMES</DATAELEMENTID><DATAELEMENTVALUE>Ram Dave</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTZIP</DATAELEMENTID><DATAELEMENTVALUE>400093</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUST_ADD1</DATAELEMENTID><DATAELEMENTVALUE>14, Samartha CHS, S.M. Road, Andheri(E)</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUSTMOBILE</DATAELEMENTID><DATAELEMENTVALUE>9819000004</DATAELEMENTVALUE></CUSTOMERDETAILS><CUSTOMERDETAILS><CUSTOMERINFORMATIONTYPECODE>CUST</CUSTOMERINFORMATIONTYPECODE><DATAELEMENTID>CUST_EMAIL</DATAELEMENTID><DATAELEMENTVALUE></DATAELEMENTVALUE></CUSTOMERDETAILS><RETAILLINEITEM><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><RETAILTYPECODE>2009</RETAILTYPECODE><RETAILREASONCODE>1010</RETAILREASONCODE><ITEMIDQUALIFIER>2</ITEMIDQUALIFIER><ITEMID>600518772</ITEMID><RETAILQUANTITY>1</RETAILQUANTITY><SALESUNITOFMEASURE /><SALESUNITOFMEASURE_ISO /><BAPISALESAMOUNT>0</BAPISALESAMOUNT><BAPINORMALSALESAMOUNT>0</BAPINORMALSALESAMOUNT><BAPICOST>0</BAPICOST><BATCHID /><SERIALNUMBER /><PROMOTIONID /><ITEMIDENTRYMETHODCODE /><BAPIACTUALUNITPRICE>0</BAPIACTUALUNITPRICE></RETAILLINEITEM><RETAILLINEITEM><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><RETAILTYPECODE>2009</RETAILTYPECODE><RETAILREASONCODE>1010</RETAILREASONCODE><ITEMIDQUALIFIER>2</ITEMIDQUALIFIER><ITEMID>000000000491192503</ITEMID><RETAILQUANTITY>1</RETAILQUANTITY><SALESUNITOFMEASURE /><SALESUNITOFMEASURE_ISO /><BAPISALESAMOUNT>0</BAPISALESAMOUNT><BAPINORMALSALESAMOUNT>0</BAPINORMALSALESAMOUNT><BAPICOST>0</BAPICOST><BATCHID /><SERIALNUMBER /><PROMOTIONID /><ITEMIDENTRYMETHODCODE /><BAPIACTUALUNITPRICE>0</BAPIACTUALUNITPRICE></RETAILLINEITEM><LINEITEMTAX><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER><TAXTYPECODE>4304</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><LINEITEMTAX><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>2</TAXSEQUENCENUMBER><TAXTYPECODE>4303</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><LINEITEMTAX><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>1</TAXSEQUENCENUMBER><TAXTYPECODE>4304</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><LINEITEMTAX><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><TAXSEQUENCENUMBER>2</TAXSEQUENCENUMBER><TAXTYPECODE>4303</TAXTYPECODE><TAXAMOUNT>0</TAXAMOUNT></LINEITEMTAX><TENDER><TENDERSEQUENCENUMBER>2</TENDERSEQUENCENUMBER><TENDERTYPECODE>3101</TENDERTYPECODE><TENDERAMOUNT>0</TENDERAMOUNT><TENDERCURRENCY>INR</TENDERCURRENCY><TENDERCURRENCY_ISO>INR</TENDERCURRENCY_ISO><TENDERID /><ACCOUNTNUMBER /><REFERENCEID /></TENDER><RETAILADDITIONALS><RETAILSEQUENCENUMBER>1</RETAILSEQUENCENUMBER><SUPPLIERID>0010000007</SUPPLIERID><SPECIALSTOCKCODE /></RETAILADDITIONALS><RETAILADDITIONALS><RETAILSEQUENCENUMBER>2</RETAILSEQUENCENUMBER><SUPPLIERID>0010000007</SUPPLIERID><SPECIALSTOCKCODE /></RETAILADDITIONALS><ADDITIONALS><TRAININGFLAG /><KEYEDOFFLINEFLAG /></ADDITIONALS></POSDM></Ticket><MSG_ID>WAWBCWLF</MSG_ID></SalesRequest></soapenv:Body></soapenv:Envelope>'